{
  "about.p1": "In the top-half of the screen is a Chinese map that represents the Ming Dynasty's best understanding of Southeast Asia and the Indian Ocean. Much of the details are based on notes from scholars that travelled with the treasure fleet voyages of <a1>Zheng He</a1>. This is reflected in the map's Chinese name, 鄭和航海圖 (Zheng He's Navigation Map). In English, it's more commonly referred to as the <a2>Mao Kun map</a2>, after the library where it was compiled.",
  "about.p2": "Zheng He's expeditions were first ordered in 1403 by the <a1>Yongle Emperor</a1>, the son of the founder of the Ming Dynasty. In all, seven major expeditions were made, ending in 1433. Several <a2>books</a2> describing the voyages were published in their immediate aftermath, but this map, as it survives today, wasn't compiled until almost 200 years later, as part of the book <a3>Wubei Zhi</a3>",
  "about.p3": "The map is read from right to left (as is the Chinese text). Starting from the imperial palace in Nanjing, it follows the Yangtze River to the coast, heads south around the Malay Peninsula and crosses the ocean, past India to the island of Hormuz. The coast of Africa doubles back along the bottom of the map, reaching all the way to Mozambique. All this territory is contorted and compressed into a long, narrow map that could be woodblock-printed onto a single scroll or twenty pages of a book.",
  "about.p4": "The data displayed in this map is available in <a1>CSV</a1> and GeoJSON formats, if you'd like to use it for another project. There are two versions of the GeoJSON: <a2>one</a2> includes all locations, even if latitude and longitude are unidentified and <a3>the other</a3> excludes unidentified locations, since they can be a problem on some platforms.",
  "about.p5": "This website was built by <a0>Ryan Carpenter</a0>, with the invaluable help of several historians and experts. I was initially inspired by <a1>Professor Anthony Barbieri</a1>, who transformed scans of the map into an image tileset capable of powering interactive maps. <a2>Aaron Jia-rong CHEN (陈佳荣)</a2> has compiled an encyclopedic catalog of Ming- and Qing-era maps of Southeast Asia and the Indian Ocean in <a3>南溟網 (South Seas Network)</a3>. He has also been kind enough to answer many questions with remarkable speed and detail and also shared the notes of his colleague <a4>Jianqiu ZHU (朱鑒秋)</a4>. The work of <a5>Sheng-I HSU (徐勝一)</a5> helped me understand how the Earth's precession explains why the <a6>kamal</a6> measurements taken by Zheng He don't match what we would see today. He was also able to answer several of my questions regarding stellar observastions in southeast Africa and the Maldives, where Polaris was not visible. <a7>José Manuel Malhão Pereira</a7> has done so much to illuminate the use of the navigation tools available to fifteenth century sailors, including helpful translations of his work from Portugese to English. Lastly, Reddit users cabaran, rankwally, ralmin, Time_Swallow, treyparkermattstone, Rogerinplay, and soowhooh in <a8>the /r/ChineseLanguage community</a8> were a big help with transcribing and translating the map text. Thanks so much to each of you.",
  "about.p6": "Many open-source resources have been used. Icons made by <a1>Freepik</a1> from <a2> www.flaticon.com</a2>. See a full OSS attribution list <a3>here</a3>."
}
