{
  "intro.abstract": "The Mao Kun Map plots a 15th-century journey from China to the Indian Ocean. To fit on printing plates, it warps the southern coast of Asia into a long strip and reads right-to-left.",

  "paths.in": "inbound, to China",
  "paths.out": "outbound, from China",

  "about.p1": "In the top-half of the screen is a Chinese map that represents the Ming Dynasty's best understanding of Southeast Asia and the Indian Ocean. Much of the details are based on notes from scholars that travelled with the treasure fleet voyages of <a1>Zheng He</a1>. This is reflected in the map's Chinese name, 鄭和航海圖 (Zheng He's Navigation Map). In English, it's more commonly referred to as the <a2>Mao Kun map</a2>, after the owner of the library where it was compiled.",
  "about.p2": "Zheng He's expeditions were first ordered in 1403 by the <a1>Yongle Emperor</a1>, the son of the founder of the Ming Dynasty. In all, seven major expeditions were made, ending in 1433. Several <a2>books</a2> describing the voyages were published in their immediate aftermath, but this map, as it survives today, wasn't compiled until almost 200 years later, as part of the book <a3>Wubei Zhi</a3>.",
  "about.p3": "The map is read from right to left (as is the Chinese text). Starting from the imperial palace in Nanjing, it follows the Yangtze River to the coast, heads south around the Malay Peninsula and crosses the ocean, past India to the island of Hormuz. The coast of Africa doubles back along the bottom of the map, reaching all the way to Mozambique. All this territory is contorted and compressed into a long, narrow map that could be woodblock-printed onto a single scroll or twenty pages of a book.",
  "about.p4": "The data displayed in this map is available in CSV and GeoJSON formats, if you'd like to use it for another project. There are two versions of the GeoJSON: one includes all locations, even if latitude and longitude are unidentified and the other excludes unidentified locations, since they can be a problem on some platforms.",
  "about.p5": "This website was built by <a0>Ryan Carpenter</a0>, with the invaluable help of several historians and experts. I was initially inspired by <a1>Anthony Barbieri</a1>, who transformed scans of the map into an image tileset capable of powering interactive maps. <a2>Aaron Jia-rong CHEN (陈佳荣)</a2> has compiled an encyclopedic catalog of Ming- and Qing-era maps of Southeast Asia and the Indian Ocean in <a3>南溟網 (South Seas Network)</a3>. He has also been kind enough to answer many questions with remarkable speed and detail and also shared the notes of his colleague <a4>Jianqiu ZHU (朱鑒秋)</a4>. The work of <a5>Sheng-I HSU (徐勝一)</a5> helped me understand how the Earth's precession explains why the <a6>kamal</a6> measurements taken by Zheng He don't match what we would see today. He was also able to answer several of my questions regarding stellar observations in southeast Africa and the Maldives, where Polaris was not visible.",
  "about.p6": "<a7>José Manuel Malhão Pereira</a7> has done so much to illuminate the use of the navigation tools available to fifteenth century sailors, including helpful translations of his work from Portugese to English. <a8>Sally K. Church</a8> answered innumerable questions and illuminated my understanding of the research of JVG Mills (especially helpful when research libraries are closed for the pandemic). Lastly, Reddit users cabaran, rankwally, ralmin, Time_Swallow, treyparkermattstone, Rogerinplay, and soowhooh in <a9>the /r/ChineseLanguage community</a9> were a big help with transcribing and translating the map text. User houseforever led the translation of this page and the glossary into Chinese. Thanks so much to each of you.",
  "about.p7": "This site makes extensive use of open-source software. See a full OSS attribution list <a1>here</a1>.",
  "about.qr": "To access project sources, download data sets, and link to other details, please visit the site on your own device.",

  "glossary.title": "Glossary of Unusual Chinese Characters",
  "glossary.衛": "A 'guard,' the highest-level unit in the Ming military hierarchy.  About 20% of the population of Ming China lived in 'military households,' which were expected to each supply one man to the army. The organization of these households was called the <a1>wei-suo</a1> or guard-battalion system, referring to the hierarchy of 5,600-man guards, 1,120-man battalions, and 112-man companies (百户), 56-man platoons (總旗), and 12-man squads (小旗).",
  "glossary.所": "A 'batallion;' perhaps the location of its headquarters. Often, it's written as 千戶所, or thousand-household battalion, referring to the typical size of this mid-level military unit.",
  "glossary.巡司": "Also known as 巡检司 (xúnjiǎnsī), this is a government department with the military and administrative functions, responsible for patrol and seizing the criminals.",
  "glossary.更": "A unit of time used to organize shifts of sailors, often referred to as a 'watch.' Since there were ten watches a day, this is equivalent to 2.4 hours. The unit also effectively measures distance. The average speed of the ship was around a walking pace, so one 更 is approximately 12 kilometers (6.5 nautical miles). Sailors would measure their speed, regularly, and adjust their time/distance measurements accordingly. If the ship was travelling faster than usual, they would reduce their expected sailing time, accordingly. Likewise, if the ship were slow, they would increase their expectation.",
  "glossary.針": "Needle- referring to the magnetic needle of a sailor's compass. Here, the character follows a pair of characters from among the 24-point <a1>Chinese compass</a1>. This tells a sailor which direction (course) to sail, relative to magnetic north. These measurements are bit imprecise; the compass points indicate a range of directions covering 15º. Plus, there is evidence that <a2>the north magnetic pole has moved significantly since the 14th century</a2>, so Ming-era sailors were measuring from a different 'north' than we would, today.",
  "glossary.托": "A unit of depth equal to four 尺 (Chinese feet). One 托 would be equal to a depth of 1⅓ meters or ¾ of a fathom. Sailors measured water depth by dropping a weighted string until they felt it bump against the bottom.",
  "glossary.指": "Finger- a unit of angular measurement used with a <a1>kamal</a1> or 'star plate.' Sailors would measure the position of a star above the horizon by outstretching their arm and counting how many fingers (or markings on the kamal) fit in between.",
  "glossary.角": "Literally, 'angle,' this is another unit of angular measurement equal to one quarter of a 指.",
  "glossary.北辰": "The North Star, or <a1>Polaris</a1>. This was the primary star used for stellar navigation. Since the axis on which the Earth spins is closely aligned with this star, it appears to remain fixed above the northern horizon, as other stars rotate around it. By at least the first century, sailors recognized that Polaris was high in the sky when they traveled far north and low in the sky farther south (until it's hidden below the horizon, near the equator). This allowed them to calculate latitude by measuring the angle between Polaris and the horizon and made it far easier to locate landmarks in the middle or on the far side of an ocean. In the 14th century, Polaris was <a2>a few degrees farther away</a2> from the north celestial pole than it is now. But, navigators were clever enough to measure against the true pole, rather than the star itself.",
  "glossary.華蓋": "Usually, <a1>Huagai</a1> refers to a constellation of seven stars that overlap what Westerners called Cassiopeia. The name refers to its shape: a canopy that covers the emperor. However, stellar observations that reference 華蓋 on this map were measured against different stars. Locations in Africa were measured against <a2>Chi Draconis</a2> (御女四). Elsewhere, 華蓋 referred to <a3>Kochab</a3> (βUMi, 華蓋星), the top outer corner of the Little Dipper. Due to the time of sunrise in spring season, the real Huagai would not have been seen by Zheng He.",
  "glossary.布司": "This is mentioned in directions near Oman and Yemen. The Bu-Si (or Puu-Si) star is often mentioned as 'commonly used to cross oceans,' but it's unclear to me which star it refers to. I've seen mentions of <a1>Pollux</a1> (β Gem, 北布司), <a2>Procyon</a2> (α CMi, 南布司), <a3>Acrab</a3> (β Sco, 西南布司星), <a4>Capella</a4> (α Aur, 西北布司星), <a5>Scheat</a5> (β Peg, 室宿二), and <a6>Fomalhaut</a6> (α PsA, 北落师门).",
  "glossary.斗": "<a1>Dipper</a1> is one of the twenty-eight 'mansions' (or constellations) that the Chinese use to organize the northern sky. Although it makes the shape of a big ladle or spoon, it does not refer to the same stars as the Big Dipper in Ursa Major. Instead, China's Dipper shares the sky with Sagittarius.",
  "glossary.落": "In the context of stars used for direction finding (not latitude calculation, with a kamal), 落 refers to the time when a star is setting on the western horizon, after it crossed the sky.",
  "glossary.上": "Likewise, 上 refers to the time when a star rises from the eastern horizon.",

  "voyages.none": "no confirmed visits",
  "voyages.1": "1st voyage: 1405-07",
  "voyages.2": "2nd voyage: 1407-09",
  "voyages.3": "3rd voyage: 1409-11",
  "voyages.4": "4th voyage: 1413-15",
  "voyages.5": "5th voyage: 1416-19",
  "voyages.6": "6th voyage: 1421-22",
  "voyages.7": "7th voyage: 1431-33",

  "en": "English",
  "zh": "Chinese",
  "config.lockPanes": "Lock Panes",
  "config.locked": "Locked",
  "config.draggable": "Draggable",
  "config.syncMaps": "Sync Maps",
  "config.synced": "Synced",
  "config.independant": "Independant",
  "config.showOverlays": "Show Overlays",
  "config.labelLocations": "Label Locations",
  "config.hidden": "Hidden",
  "config.shown": "Shown"
}
